arm-university/Digital-Signal-Processing-Education-Kit/STM32F746G Discovery board/contents/Module_1/Lab/DSP Education Kit/Src/stm32f7_display.c
/**
  ******************************************************************************
  * @file    display.c 
  * @author  ARM University Program
  * @date    Summer 2017 
  * @brief   This file provides functions for drawing graphs on the LCD.
  *					 Must call init_LCD() before calling the other drawing functions.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f7_display.h"

int refresh_counter = 0;	//Control the refresh rate
//If the program is intr, this factor will be larger
//because the intr program will run faster than dma program
int refresh_counter_factor = 1;

int button_flag = 0;	//A flag to control the button state
int stop = 0;	//A flag to stop drawing the graph to make a static graph
int update_flag = 0; //A flag to indicate the screen is going to update

int fixymax, fixymin = 0; //A variable to save the ymax and ymin which use in drawAxes()

//Global variable to store the sampling frequency that get from the main program
//use it in drawAxes(), initialise to a random value
uint16_t frequency = 0;

//A temporary buffer to store data from the main
//use in plotSamplesIntr()
int16_t temp_buffer[256];
int16_t temp_buffer_ptr = 0;

/**
  * @brief  Check for user input.
  * @param  None
  * @retval Input state (1 : active / 0 : Inactive)
  */
 uint8_t CheckForUserInput(void)
{
  if (BSP_PB_GetState(BUTTON_KEY) != RESET)
  {
//    HAL_Delay(10);
    while (BSP_PB_GetState(BUTTON_KEY) != RESET);
    return 1 ;
  }
  return 0;
}

/**
  * @brief  Drawing the graph grid at the logo layer which won't have frequent change       
  * @param  name: Name of the main file
  * @retval none
  */
	
void drawGrid(char * name) {
	int i = 0;
	
	//Choose the logo layer
	BSP_LCD_SelectLayer(0);
	BSP_LCD_Clear(BACKGROUND_COLOUR);

	//Show the main file name at the top-right hand corner
	BSP_LCD_SetBackColor(BACKGROUND_COLOUR);	
	BSP_LCD_SetTextColor(GRID_COLOUR);	
	if(strlen(name) > 28) BSP_LCD_SetFont(&Font12);
	else BSP_LCD_SetFont(&Font16);
	BSP_LCD_DisplayStringAt(0, 0, (uint8_t *)name, RIGHT_MODE);		
	
	//Draw the grid area
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
	BSP_LCD_DrawRect(FIRST_DATA_PIXEL, HEADER_HEIGHT, GRAPH_WIDTH, GRAPH_HEIGHT);

	//Drawing grid lines
	for(i = 0; i < 5; i++) {
		BSP_LCD_DrawVLine(FIRST_DATA_PIXEL+64*i, HEADER_HEIGHT, GRAPH_HEIGHT+5);	
		BSP_LCD_DrawHLine(FIRST_DATA_PIXEL, HEADER_HEIGHT+48*i, GRAPH_WIDTH);
	}
	
	//Go back to the graph layer for the remaining graph drawing
	BSP_LCD_SelectLayer(LTDC_ACTIVE_LAYER);
	BSP_LCD_Clear(BACKGROUND_COLOUR);
	BSP_LCD_SetTransparency(1, 200);
}

/**
  * @brief  Display the x and y axis values and labels       
  * @param  ycentre: pixel of the y centre line of the graph
  * @param  ymax: maximum data pixel y location
  * @param  ymin: minimum data pixel y location
  * @param  max: maximum data actual value
  * @param  min: minimum data actual value
  * @param  size: size of the displaying buffer
  * @param  xpos: last data in the buffer pixel x location
  * @param  mode: graph type WAVE/ FFT/ LOG FFT/ LMS
  * @retval none
  */

void drawAxes (int ycentre, int ymax, int ymin, float max, float min, float dB_per_divs, int size, int xpos, int type) {
	uint32_t axes_value [20];

	int i = 0;
	
	BSP_LCD_SetFont(&Font12);

	/*Drawing y axis*/
	
	//If the max/min value doesn't change or user didn't push the button, stop drawing the y-axis to prevent flickering on the axis
	if(fixymax != ymax || fixymin != ymin || update_flag == 1){
		fixymax = ymax;
		fixymin = ymin;

		//Clear the y-axis area
		BSP_LCD_SetTextColor(BACKGROUND_COLOUR);
		BSP_LCD_FillRect(0, HEADER_HEIGHT, FIRST_DATA_PIXEL, 272);
		BSP_LCD_SetTextColor(TEXT_COLOUR);
		BSP_LCD_SetBackColor(BACKGROUND_COLOUR);		

		if(dB_per_divs != 0) {
			sprintf((char*)axes_value, "%.3f dB/div", dB_per_divs);
			BSP_LCD_DisplayStringAt(0, 20, (uint8_t * ) &axes_value, LEFT_MODE);	
			
			if(ycentre != FFT_YCENTRE) {
				//Display 0
				sprintf((char*)axes_value, "%c", '0');
				BSP_LCD_DisplayStringAt(0, ycentre, (uint8_t * ) &axes_value, LEFT_MODE);					
			}
			
		} else {
			//Display 0
			
			sprintf((char*)axes_value, "%c", '0');
			BSP_LCD_DisplayStringAt(0, ycentre, (uint8_t * ) &axes_value, LEFT_MODE);	
			
			if((ycentre - ymax) > 5) { 
				sprintf((char*)axes_value, "%.3f", max);
				BSP_LCD_DisplayStringAt(0, ymax, (uint8_t * ) &axes_value, LEFT_MODE);
			}		
			
			if((ymin - ycentre) > 5) { 
				//BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);	//for debugging
				sprintf((char*)axes_value, "%.3f", min);
				BSP_LCD_DisplayStringAt(0, ymin, (uint8_t * ) &axes_value, LEFT_MODE);
			}
		}
		update_flag = 0;
	}	
	
	/*Drawing x axis*/	
	
	switch(type){
		
		case LMS:
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(0, 0, (uint8_t * ) "sample value", LEFT_MODE);		

			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_SetBackColor(BACKGROUND_COLOUR);
		
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(20, GRAPH_VER_END_PIXEL - 15, (uint8_t * ) "Time(s)", RIGHT_MODE);
			//BSP_LCD_DisplayStringAt(20, 50, (uint8_t * ) "LMS Graph", RIGHT_MODE); //Uncomment this if the graph name is needed on screen
			
			sprintf((char*)axes_value, "%c", '0');
			BSP_LCD_DisplayStringAt(FIRST_DATA_PIXEL+3, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);
			
			for(i = 1; i < 5; i++) {
				sprintf((char*)axes_value, "%.3f", (float)64*i/frequency);
				BSP_LCD_DisplayStringAt(FIRST_DATA_PIXEL+64*i+3, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);
			}
			break;
			
		case FFT:

			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(0, 0, (uint8_t * ) "Magnitude", LEFT_MODE);
		
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(20, GRAPH_VER_END_PIXEL - 15, (uint8_t * ) "Frequency(Hz)", RIGHT_MODE);	
			//BSP_LCD_DisplayStringAt(20, 50, (uint8_t * ) "FFT Graph", RIGHT_MODE);	//Uncomment this if the graph name is needed on screen
		
