arm-university/Digital-Signal-Processing-Education-Kit/STM32F746G Discovery board/contents/Module_1/Lab/DSP Education Kit/Src/stm32f7_display.c
			sprintf((char*)axes_value, "%c", '0');
			BSP_LCD_DisplayStringAt(FIRST_DATA_PIXEL, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);		
		
			sprintf((char*)axes_value, "%d", frequency/2);
			BSP_LCD_DisplayStringAt(xpos, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);
		
			break;
		
		case WAVE:
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(0, 0, (uint8_t * ) "sample value", LEFT_MODE);
		
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(20, GRAPH_VER_END_PIXEL - 15, (uint8_t * ) "sample number", RIGHT_MODE);	
			//BSP_LCD_DisplayStringAt(20, 50, (uint8_t * ) "Input signal", RIGHT_MODE);	//Uncomment this if the graph name is needed on screen
		
			sprintf((char*)axes_value, "%c", '0');
			BSP_LCD_DisplayStringAt(FIRST_DATA_PIXEL, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);		
		
			sprintf((char*)axes_value, "%d", size);
			BSP_LCD_DisplayStringAt(xpos, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);
			break;
		
		case LOGFFT:
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(0, 0, (uint8_t * ) "Magnitude(dB)", LEFT_MODE);
			//BSP_LCD_DisplayStringAt(20, 50, (uint8_t * ) "FFT Graph", RIGHT_MODE);	//Uncomment this if the graph name is needed on screen
		
			BSP_LCD_SetTextColor(TEXT_COLOUR);
			BSP_LCD_DisplayStringAt(20, GRAPH_VER_END_PIXEL - 15, (uint8_t * ) "Frequency(Hz)", RIGHT_MODE);	

			sprintf((char*)axes_value, "%c", '0');
			BSP_LCD_DisplayStringAt(FIRST_DATA_PIXEL, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);		
		
			sprintf((char*)axes_value, "%d", frequency/2);
			BSP_LCD_DisplayStringAt(xpos, GRAPH_VER_END_PIXEL+2, (uint8_t * ) &axes_value, LEFT_MODE);			
			break;
	}
		
}

/**
  * @brief  Initialise the LCD screen, initialise 2 layers
	*					layer 0 is for the logo and unchange elements
	*					layer 1 (LTDC_ACTIVE_LAYER) is for graph data
	*					Display the start screen which have logo and title
	*					Draw the grid
  * @param  sample_frequency: get the sample frequency from the main and save in the global
	*														variable frequency
  * @param  name: get the program name from the main and use in
	*								the drawGrid()
  * @param  io_method: IO_METHOD_DMA = slower refresh rate,
	*										 IO_METHOD_INTR = faster refresh rate
  * @param  graph: GRAPH = display graph, NOGRAPH = display start screen only
  * @retval none
  */

void init_LCD(int16_t sample_frequency, char *name, int16_t io_method, int graph) {

	frequency = sample_frequency;

	// Set up the LCD
	BSP_LCD_Init();
	
	BSP_LCD_LayerDefaultInit(0, 0xC0400000); //Initialise the logo layer
	BSP_LCD_LayerDefaultInit(LTDC_ACTIVE_LAYER, LCD_FRAME_BUFFER);
	
	BSP_LCD_DisplayOn();
	
	//BSP_LCD_SetLayerVisible(0, ENABLE);
	BSP_LCD_SelectLayer(0);
	BSP_LCD_Clear(0xFF0090BF);
	
	BSP_LCD_SelectLayer(LTDC_ACTIVE_LAYER);
	BSP_LCD_Clear(BACKGROUND_COLOUR);
	
	BSP_LCD_SetTransparency(0, 255);
	BSP_LCD_SetTransparency(1, 150);
	
	BSP_LCD_SelectLayer(0);
	/* Draw Bitmap Logo*/
	BSP_LCD_DrawBitmap(50, 70, (uint8_t *)armlogo);

	BSP_LCD_SelectLayer(LTDC_ACTIVE_LAYER);	
	 /* Set the LCD Text Color */
	BSP_LCD_SetTextColor(TEXT_COLOUR);
	
	 /* Display LCD messages */
	BSP_LCD_DisplayStringAt(0, 10, (uint8_t *)"STM32F746G DSP Education Kit", CENTER_MODE);
	if(strlen(name) > 28) BSP_LCD_SetFont(&Font16);
	BSP_LCD_DisplayStringAt(0, 50, (uint8_t *)name, CENTER_MODE);
	BSP_LCD_SetFont(&Font24);
	if(io_method == 0) {
		refresh_counter_factor = 100;
	}
	if(graph == 1){
		BSP_LCD_DisplayStringAt(0, 200, (uint8_t *)"Press User Button to start", CENTER_MODE);
		while(CheckForUserInput() != 1){}	
			
		drawGrid(name);
	}
}

/**
  * @brief  Clear the graph area only, draw vertical lines from the start of
	*					the graph to the end of the graph
  * @param  none
  * @retval none
  */

void clearScreen () {
	unsigned i = 0;
	
	refresh_counter = 0;
	
	for(i = FIRST_DATA_PIXEL; i < GRAPH_WIDTH+FIRST_DATA_PIXEL; i++) {	
		BSP_LCD_SetTextColor(BACKGROUND_COLOUR);
		BSP_LCD_DrawVLine(i, 0, GRAPH_VER_END_PIXEL);	
	}
}

/**
  * @brief  For debug only, display the axes data on the screen
  * @param  ymax: maximum data pixel y location
  * @param  ymin: minimum data pixel y location
  * @param  max: maximum data actual value
  * @param  min: minimum data actual value
  * @param  yscalefactor: y scale factor
  * @retval none
  */

void debug_display(int ymax, int ymin, float max, float min, float biggestmag, float yscalefactor) {
	uint8_t axes_debug_value [20];

	BSP_LCD_SetFont(&Font12);
	
	sprintf((char*)axes_debug_value, "ymax: %d", ymax);
	BSP_LCD_DisplayStringAt(10, 20, (uint8_t * ) &axes_debug_value, RIGHT_MODE);
	sprintf((char*)axes_debug_value, "ymin: %d", ymin);
	BSP_LCD_DisplayStringAt(10, 30, (uint8_t * ) &axes_debug_value, RIGHT_MODE);
	sprintf((char*)axes_debug_value, "max: %g", max);
	BSP_LCD_DisplayStringAt(10, 40, (uint8_t * ) &axes_debug_value, RIGHT_MODE);
	sprintf((char*)axes_debug_value, "min: %g", min);
	BSP_LCD_DisplayStringAt(10, 50, (uint8_t * ) &axes_debug_value, RIGHT_MODE);
	sprintf((char*)axes_debug_value, "ycentre: %g", biggestmag);
	BSP_LCD_DisplayStringAt(10, 60, (uint8_t * ) &axes_debug_value, RIGHT_MODE);	
	sprintf((char*)axes_debug_value, "yscalefactor: %g", yscalefactor);
	BSP_LCD_DisplayStringAt(10, 70, (uint8_t * ) &axes_debug_value, RIGHT_MODE);	
}

/**
  * @brief  Draw bars according to the value inside data_buffer
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
  * @param  live: static data = 0, live data = 1
  * @param  complex: complex data = 1, non-complex data = 0
  * @retval none
  */

void plotWave(float32_t * data_buffer, int num_samples, int live, int complex) {
	int16_t i;
	int16_t xvalue;              // x in pixels
	int16_t ymax = HEADER_HEIGHT;
	int16_t ymin = GRAPH_VER_END_PIXEL;                  // max and min y values in pixels
	float32_t max, min = data_buffer[0]; // max and min y values passed to function
	float32_t biggestmag, yscalefactor;
	float x_spacing = 1;
	int step = 1;
	
	if(complex) step = 2;
	
	x_spacing = GRAPH_WIDTH / (num_samples*step);
	
	// initialise some variables
	max = data_buffer[0];
	min = data_buffer[0];
	xvalue = FIRST_DATA_PIXEL;
	
	//Whenever user push the button or live data is needed, bar charts will be drawn,
	//Otherwise, the graph will only be drawn once
	if(stop == 0 || CheckForUserInput() == 1 || live == 1){
		//If static data is needed, the graph will only be drawn once
		stop = 1;

