arm-university/Digital-Signal-Processing-Education-Kit/STM32F746G Discovery board/contents/Module_1/Lab/DSP Education Kit/Src/stm32f7_display.c
		// determine min and max values
		for(i = 0; i < num_samples*step; i++) {		
			if(min >= data_buffer[i])	min = data_buffer[i];
			if(max <= data_buffer[i]) max = data_buffer[i];
		}

		//Determine the largest value and limit the graph size by using yscalefactor
		if(max*max > min*min) biggestmag = max; else biggestmag = -min;
		if(biggestmag == 0) biggestmag = 1;
		
		yscalefactor = 100/(biggestmag); // 100 is +/- pixels from centre of screen
		ymin = GRAPH_YCENTRE - min*yscalefactor;
		ymax = GRAPH_YCENTRE - max*yscalefactor;		
		
		for(i = 0; i < num_samples*step; i++) {
			//Clear the previous bar before drawing the new bar on the screen
			BSP_LCD_SetTextColor(BACKGROUND_COLOUR);	
			BSP_LCD_DrawLine(xvalue, 0, xvalue, 272);
			
			//if the data is complex values, real values and imaginary values will
			//display in different colour
			if(complex) {
				if(i % 2 == 0)
					BSP_LCD_SetTextColor(GRAPH_COLOUR);		
				else
					BSP_LCD_SetTextColor(IMAGINARY_COLOUR);	
			} else
				BSP_LCD_SetTextColor(GRAPH_COLOUR);		
			
			//Draw the bars
			BSP_LCD_DrawLine(xvalue, GRAPH_YCENTRE, xvalue, GRAPH_YCENTRE - data_buffer[i]*yscalefactor);

			xvalue += x_spacing;
		}
		
		//debug_display(ymax,ymin,max,min,data_buffer[10],data_buffer[20]);
		
		//Draw the axes values and labels
		drawAxes (GRAPH_YCENTRE, ymax, ymin, max, min, 0, num_samples, xvalue, WAVE);
	}
}

/**
  * @brief  Draw bars according to the value inside data_buffer but without auto-scaling
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
  * @retval none
  */

void plotWaveNoAutoScale(float32_t * data_buffer, int num_samples) {
	unsigned i = 0;
	int xcoor = FIRST_DATA_PIXEL;
	
	int ymax = 20;
	int ymin = GRAPH_VER_END_PIXEL;
	float max, min = data_buffer[0];
	
	float yscalefactor = 270;
	
	float x_spacing = 1;

	x_spacing = GRAPH_WIDTH / num_samples;	

		
	for(i = 0; i < num_samples; i++) {
		//Clear the previous bar before drawing the new bar on the screen
		BSP_LCD_SetTextColor(BACKGROUND_COLOUR);
		BSP_LCD_DrawLine(xcoor, 0, xcoor, 272);
			
		//Draw the bars
		BSP_LCD_SetTextColor(GRAPH_COLOUR);		
		BSP_LCD_DrawLine(xcoor, GRAPH_YCENTRE, xcoor, GRAPH_YCENTRE - data_buffer[i]/yscalefactor);
		
		// determine min and max values	to draw the y-axis
		if(min >= data_buffer[i]){
			ymin = GRAPH_YCENTRE - data_buffer[i]/yscalefactor;
			min = data_buffer[i];
		} 
		if(max <= data_buffer[i]){
			ymax = GRAPH_YCENTRE - data_buffer[i]/yscalefactor;
			max = data_buffer[i];
		}
		
		//Safety measure to avoid the bars go outside the grid area
		if(ymax < HEADER_HEIGHT) ymax = HEADER_HEIGHT;
		if(ymin > GRAPH_VER_END_PIXEL) ymin = GRAPH_VER_END_PIXEL;
		
		xcoor += x_spacing;
	}
	//debug_display(ymax,ymin,max,min,20,yscalefactor);
	drawAxes (GRAPH_YCENTRE, ymax, ymin, max, min, 0, num_samples, xcoor, WAVE);

}

/**
  * @brief  Draw bars according to the value inside data_buffer,
	*					if buffer size is smaller than the no of plots, repeat the graph
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
  * @param  num_plots: how many data points needed to plot
  * @retval none
  */

void plotSamples(int16_t * data_buffer, int num_samples, int num_plots) {
	int16_t i;
	int16_t xvalue;              // x in pixels
	int16_t ymax = HEADER_HEIGHT;
	int16_t ymin = GRAPH_VER_END_PIXEL;                  // max and min y values in pixels
	float32_t max, min = data_buffer[0]; // max and min y values passed to function
	float32_t biggestmag, yscalefactor;
	int counter = 0;
	float x_spacing = 1;

	// initialise some variables
	max = data_buffer[0];
	min = data_buffer[0];
	xvalue = FIRST_DATA_PIXEL;

	x_spacing = GRAPH_WIDTH / num_plots;
	// determine min and max values
	for(i = 0; i < num_samples; i++) {		
		if(min >= data_buffer[i])	min = data_buffer[i];
		if(max <= data_buffer[i]) max = data_buffer[i];
	}

	//Determine the largest value and limit the graph size by using yscalefactor
	if(max*max > min*min) biggestmag = max; else biggestmag = -min;
		
	yscalefactor = 100/(biggestmag); // 100 is +/- pixels from centre of screen
	ymin = GRAPH_YCENTRE - min*yscalefactor;
	ymax = GRAPH_YCENTRE - max*yscalefactor;		
		
	for(i = 0; i < num_plots; i++) {
		//Draw the bars
		BSP_LCD_SetTextColor(GRAPH_COLOUR);		
		BSP_LCD_DrawLine(xvalue, GRAPH_YCENTRE, xvalue, GRAPH_YCENTRE - data_buffer[counter]*yscalefactor);

		if(counter >= num_samples - 1)
			counter = 0;
		else
			counter ++;

		xvalue += x_spacing;
	}
	//Draw the axes values and labels
	drawAxes (GRAPH_YCENTRE, ymax, ymin, max, min, 0, num_plots, xvalue, WAVE);
}

/**
  * @brief  Save data_sample to the temporary buffer
  * @brief  Draw the graph from the temporary buffer only when enough data points have got
  * @param  data_sumple: a pointer that points to the data that need to plot
  * @param  num_plots: how many data points needed to plot
  * @retval none
  */

void plotSamplesIntr(int16_t data_sample, int num_plots) {
	float x_spacing = 1;
	unsigned int i = 0;

	int xvalue = FIRST_DATA_PIXEL;
	int ymax = 20;
	int ymin = GRAPH_VER_END_PIXEL;
	float max, min = data_sample;
	float32_t biggestmag, yscalefactor;

	if(stop == 0){
		x_spacing = GRAPH_WIDTH / num_plots;
		temp_buffer[temp_buffer_ptr] = data_sample;
		temp_buffer_ptr++;
		if(temp_buffer_ptr >= num_plots){
			temp_buffer_ptr = 0;
			stop = 1;

			for(i = 0; i < num_plots; i++) {		
				if(min >= temp_buffer[i]) min = temp_buffer[i];
				if(max <= temp_buffer[i]) max = temp_buffer[i];
			}

			//Determine the largest value and limit the graph size by using yscalefactor
			if(max*max >= min*min) biggestmag = max; else biggestmag = -min;
					
			yscalefactor = 100/(biggestmag); // 100 is +/- pixels from centre of screen
			ymin = GRAPH_YCENTRE - min*yscalefactor;
			ymax = GRAPH_YCENTRE - max*yscalefactor;	
			
			BSP_LCD_SetTextColor(GRAPH_COLOUR);						
			for(i = 0; i < num_plots; i++) {
				//Draw the bars
				BSP_LCD_SetTextColor(GRAPH_COLOUR);		
				BSP_LCD_DrawLine(xvalue, GRAPH_YCENTRE, xvalue, GRAPH_YCENTRE - temp_buffer[i]*yscalefactor);		
				xvalue += x_spacing;			
			}
			
			drawAxes (GRAPH_YCENTRE, ymax, ymin, max, min, 0, num_plots, xvalue, WAVE);
		}
	}	
}

/**
  * @brief  Plot the FFT graph according to the data buffer
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
	* @param  auto_scale: AUTO_SCALING: auto scaling of the y-axis,
												NO_AUTO_SCALING: no auto scaling of the y-axis
  * @retval none
  */

