arm-university/Digital-Signal-Processing-Education-Kit/STM32F746G Discovery board/contents/Module_1/Lab/DSP Education Kit/Src/stm32f7_display.c
void plotFFT(float32_t * data_buffer, int num_samples, int auto_scale){	
	int16_t i;
	int16_t xvalue;              // x and y value in pixels
	int16_t ymax = HEADER_HEIGHT;				 // max and min y values in pixels
	int16_t	ymin = GRAPH_VER_END_PIXEL;          
	float32_t max, min; // max and min y values passed to function
	float32_t biggestmag, yscalefactor;

	float x_spacing = 1;

	x_spacing = GRAPH_WIDTH / num_samples;	
	
	// initialise some variables
	max = data_buffer[0];
	min = data_buffer[0];
	xvalue = FIRST_DATA_PIXEL;
	
	//Refresh the screen in a specific rate, larger the number, slower refresh rate
	if(refresh_counter > 40) {
		clearScreen();
		refresh_counter = 0;
	}
				
	// determine min and max values
	for(i = 0; i < num_samples; i++) {		
		if(min >= data_buffer[i])	min = data_buffer[i];
		if(max <= data_buffer[i]) max = data_buffer[i];
	}
	
	//If y-axis needed to auto-scaling, have to work out the yscalefactor to limit the
	//graph size. If no auto-scaling, the yscalefactor will set to a fix value
	switch(auto_scale){
		case AUTO_SCALING:
			
			//Determine the largest value and limit the graph size by using yscalefactor
			if(max*max > min*min) biggestmag = max; else biggestmag = -min;
			
			yscalefactor = 200/(biggestmag); // 200 is +/- pixels from centre of screen

			break;
		
		case NO_AUTO_SCALING:
			yscalefactor = 0.0075;
		
			break;

	}
	ymin = FFT_YCENTRE - min*yscalefactor;
	ymax = FFT_YCENTRE - max*yscalefactor;	
	
	BSP_LCD_SetTextColor(GRAPH_COLOUR);	
	
	//Safety measure to prevent the graph go off the screen	
	if(ymax < HEADER_HEIGHT)
		ymax = HEADER_HEIGHT;
	
	//Draw the bars, only draw half of the data buffer because the other half data is duplicated
	for(i = 0; i < num_samples/2; i++) {		
		BSP_LCD_DrawLine(xvalue, FFT_YCENTRE, xvalue, FFT_YCENTRE - data_buffer[i]*yscalefactor);
		BSP_LCD_DrawLine(xvalue, FFT_YCENTRE, xvalue, FFT_YCENTRE - data_buffer[i]*yscalefactor);

		xvalue += x_spacing*2;
	}
	
	//debug_display(ymax,ymin,max,min,biggestmag,yscalefactor);
	//Draw the axes values and labels	
	drawAxes (FFT_YCENTRE, ymax, ymin, max, min, 0, num_samples, xvalue, FFT);
	refresh_counter ++;

}

/**
  * @brief  Plot the FFT graph in decibel according to the data buffer
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
  * @param  live: LIVE = plot the graph live
	*								STATIC = will only draw the graph once
  * @retval none
  */

void plotLogFFT(float32_t *(data_buffer), int num_samples, int live){	
	int16_t i;
	int16_t xvalue = FIRST_DATA_PIXEL;
	int16_t yvalue;              // x and y value in pixels
	int16_t ymax = HEADER_HEIGHT;
	int16_t ymin = GRAPH_VER_END_PIXEL;                // max and min y values in pixels
	float32_t max, min, dB_per_divs;                  // max and min y values passed to function
	float32_t biggestmag, yscalefactor;
	int16_t ycentre = FFT_YCENTRE;
	int negative = 0;
	int pixels_from_centre = 180;

	float x_spacing = 1;

	x_spacing = GRAPH_WIDTH / num_samples;	
	
	//the data can't be zero as it has to be used in log calculation afterwards
	if(data_buffer[0] == 0)
		return;

	if(stop == 0) {
		if(live == 0){
			stop = 1;
		}	else
			stop = 0;
		//Refresh the screen in a specific rate, larger the number, slower refresh rate	
		if(refresh_counter > 100*refresh_counter_factor) {
			clearScreen();
			refresh_counter = 0;
		}
		
		if(refresh_counter == 0){
			
			// initialise some variables
			max = 20 * log10(data_buffer[0]);
			min = 20 * log10(data_buffer[0]);

			for(i = 0; i < num_samples; i++) {		
				if(data_buffer[i] == 0)
					return;
				//Calculate the decibel of the data
				data_buffer[i] = 20 * log10(data_buffer[i]);
				
				//Determine where is the y-axis centre
				if(data_buffer[i] < 0) negative++;
				
				if(min >= data_buffer[i])	min = data_buffer[i];
				if(max <= data_buffer[i]) max = data_buffer[i];
			}
			if(max*max > min*min) biggestmag = max; else biggestmag = -min;
			
			if(negative != num_samples && negative != 0) {
				pixels_from_centre = 100;
				ycentre = GRAPH_YCENTRE;
			} else if (negative == num_samples){
				pixels_from_centre = 150;
				ycentre = LOGFFT_YCENTRE;
			} else {
				pixels_from_centre = 200;
				ycentre = FFT_YCENTRE;
			}

			yscalefactor = pixels_from_centre/(biggestmag); // pixels_from_centre is +/- pixels from centre of screen
			ymin = ycentre - min*yscalefactor;
			ymax = ycentre - max*yscalefactor;	

			dB_per_divs = (max - min)*48/abs(ymin - ymax);
			
			BSP_LCD_SetTextColor(GRAPH_COLOUR);	
			
			for(i = 0; i < num_samples/2; i++) {		
				yvalue = ycentre - data_buffer[i]*yscalefactor;
				
				//Determine if the plotting out of the graph area, if yes plot it at the bottom of the graph
				if(yvalue > GRAPH_VER_END_PIXEL){
					yvalue = GRAPH_VER_END_PIXEL;
				}	else if (yvalue < HEADER_HEIGHT) {
					yvalue = HEADER_HEIGHT;
				}
				
				BSP_LCD_DrawLine(xvalue, GRAPH_VER_END_PIXEL, xvalue, yvalue);

				xvalue += x_spacing*2;
			}

			//Determine the largest value and limit the graph size by using yscalefactor	
/*			if(max*max > min*min) biggestmag = max; else biggestmag = -min;
			
			//As the ycenter move up so less pixels from centre of screen
			if(ycenter == LOGFFT_YCENTRE) yscalefactor = 40/(biggestmag); // 40 is +/- pixels from centre of screen
			else yscalefactor = 200/(biggestmag); // 200 is +/- pixels from centre of screen
			ymin = ycenter - min*yscalefactor;
			ymax = ycenter - max*yscalefactor;	

			dB_per_divs = (max - min)*48/abs(ymin - ymax);
			BSP_LCD_SetTextColor(GRAPH_COLOUR);	
			
			for(i = 0; i < num_samples/2; i++) {		
				yvalue = ycenter - data_buffer[i]*yscalefactor;
				
				//Determine if the plotting out of the graph area, if yes plot it at the bottom of the graph
				if(yvalue > GRAPH_VER_END_PIXEL){
					yvalue = GRAPH_VER_END_PIXEL;
				}	else if (yvalue < HEADER_HEIGHT) {
					yvalue = HEADER_HEIGHT;
				}
				
				BSP_LCD_DrawLine(xvalue, GRAPH_VER_END_PIXEL, xvalue, yvalue);

