arm-university/Digital-Signal-Processing-Education-Kit/STM32F746G Discovery board/contents/Module_1/Lab/DSP Education Kit/Src/stm32f7_display.c
				xvalue += x_spacing*2;
			}*/

			//debug_display(ymax, ymin, max, min, ycentre, yscalefactor);	
			drawAxes (ycentre, ymax, ymin, max, min, dB_per_divs, num_samples, xvalue, LOGFFT);
			negative = 0;
		}
		refresh_counter ++;
	}
}

/**
  * @brief  Plot the LMS graph according to the data buffer
  * @param  data_buffer: a pointer that points to the data that need to plot
  * @param  num_samples: number of the plotted data buffer
  * @param  live: LIVE = plot the graph live
	*								STATIC = will only draw the graph once
  * @retval none
  */

void plotLMS(float32_t * data_buffer, int num_samples, int live) {
	int16_t i;
	int16_t xvalue, yvalue;              // x and y value in pixels
	int16_t ymax, ymin;                  // max and min y values in pixels
	float32_t max, min;                  // max and min y values passed to function
	float32_t biggestmag, yscalefactor;

	float x_spacing = 1;

	x_spacing = GRAPH_WIDTH / num_samples;	
	
	if(stop == 0){	
		if(live == 0)
			stop = 1;
		else
			stop = 0;
		
		// initialise some variables
		max = data_buffer[0];
		min = data_buffer[0];
		xvalue = FIRST_DATA_PIXEL;
		
			
		// determine min and max values
		for(i = 0; i < num_samples; i++) {		
			if(min >= data_buffer[num_samples - 1 - i])	min = data_buffer[num_samples - 1 - i];
			if(max <= data_buffer[num_samples - 1 - i]) max = data_buffer[num_samples - 1 - i];
		}
		
		//Determine the largest value and limit the graph size by using yscalefactor	
		if(max*max > min*min) biggestmag = max; else biggestmag = -min;

		yscalefactor = (GRAPH_YCENTRE-60)/(biggestmag); // 100 is +/- pixels from centre of screen
		ymin = GRAPH_YCENTRE - min*yscalefactor;
		ymax = GRAPH_YCENTRE - max*yscalefactor;
		
		BSP_LCD_SetTextColor(GRAPH_COLOUR);
		for(i = 0; i < num_samples; i++) {		
			//truncates the decimal value from floating point value and returns integer value
			yvalue = GRAPH_YCENTRE - trunc(data_buffer[num_samples - 1 - i]*yscalefactor);
			
			//Determine if the plotting out of the graph area, if yes plot it at the limit of the graph area
			if(yvalue > GRAPH_VER_END_PIXEL){
				yvalue = GRAPH_VER_END_PIXEL;
			}	else if (yvalue < HEADER_HEIGHT) {
				yvalue = HEADER_HEIGHT;
			}
			
			BSP_LCD_DrawLine(xvalue, GRAPH_YCENTRE, xvalue, yvalue);
			xvalue += x_spacing;
		}
		
		drawAxes (GRAPH_YCENTRE, ymax, ymin, max, min, 0, num_samples, xvalue, LMS);

		//Refresh the screen in a specific rate, larger the number, slower refresh rate	
		if(refresh_counter > 100) {
			clearScreen();
			refresh_counter = 0;
		} 

		refresh_counter ++;
	}
}

/**
  * @brief  Change the global variable button_flag to a specific value
  * @brief  Button_flag control 3 states only
  * @param  value: No effect if value smaller than 0 or greater than 3
  * @retval none
  */

void changeButtonFlag(int value) {
	button_flag = value;
}

/**
  * @brief  Get the value of the global variable button_flag and check the user button status
  * @brief  Button_flag control 3 states only
  * @param  none
	* @retval button_flag: return the state
  */

int checkButtonFlag() {

	//If user press the button, the whole screen will be cleared and change the state
	if(CheckForUserInput() == 1) {
		refresh_counter = 0;
		stop = 0;
		BSP_LCD_Clear(BACKGROUND_COLOUR);
		button_flag++;
	} 

	
	//If button flag greater than 2, the button flag will go the first state and reset everything
	if(button_flag >= 2) {
		stop = 0;
		button_flag=0;	
	}

	return button_flag;
}

/**
  * @brief  To configure the system clock. There's an exactly the same function in
	*					stm32f7_wm8994_init.c This function will only use when stm32f7_wm8994_init
	*					didn't call in the main
  * @param  none
  * @retval none
  */

static void SystemClock_Config_LCD(void){
  HAL_StatusTypeDef ret = HAL_OK;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();

  /* The voltage scaling allows optimizing the power consumption when the device is
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 8;
  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  ASSERT(ret != HAL_OK);

  /* activate the OverDrive */
  ret = HAL_PWREx_ActivateOverDrive();
  ASSERT(ret != HAL_OK);

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
  ASSERT(ret != HAL_OK);
}

/**
  * @brief  To initialise the LCD.
	*					This function will only use when stm32f7_wm8994_init
	*					didn't call in the main
  * @param  sample_frequency: get the sample frequency from the main and 
	*														pass it to init_LCD()
  * @param  name: get the program name from the main and pass it to
	*								init_LCD()
  * @param  graph: GRAPH = display graph, NOGRAPH = display start screen only
  * @retval none
  */

void stm32f7_LCD_init(int16_t sample_frequency, char *name, int graph){	

	
	//Enable I-Cache
  SCB_EnableICache();
	
  //Enable D-Cache
  SCB_EnableDCache();

	SystemClock_Config_LCD(); // configure the system clock to 200 Mhz
	BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO); // configure the  blue user pushbutton in GPIO mode
	BSP_LED_Init(LED1);   // initialise LED on GPIO pin P   (also accessible on arduino header)
	BSP_SDRAM_Init();
	init_LCD(sample_frequency, name, 0, graph);
}

/**
  * @brief  Display a statement on the top of the screen also reset the stop global variable.
	*					This global variable is used to draw the static graph
	*	@brief	Can add a paramenter to display custom string, change the default string to the
	*					paramenter's name, type of the parameter is char *
  * @param  none
  * @retval none
  */

void proceed_statement(){
	stop = 0;
	update_flag = 1;
	
	BSP_LCD_SetFont(&Font12);
	
	BSP_LCD_DisplayStringAt(100, 10, (uint8_t * ) "Push button to next screen", LEFT_MODE);
	
	while(CheckForUserInput() != 1){}	
}
